### 1. Crie uma tabela chamada "alunos" com os seguintes campos: id (inteiro), nome (texto), idade (inteiro) e curso (texto).
### 2. Insira pelo menos 5 registros de alunos na tabela que você criou no exercício anterior

In [6]:
import sqlite3

conexao = sqlite3.connect('alunos')
cursor = conexao.cursor()

cursor.execute('CREATE TABLE alunos(id INT, nome VARCHAR(100), idade INT, curso VARCHAR(100));')
cursor.execute('INSERT INTO alunos(id,nome,idade,curso) VALUES(1,"Ana",22,"Arrquitetura")')
cursor.execute('INSERT INTO alunos(id,nome,idade,curso) VALUES(2,"João",23,"Engenharia")')
cursor.execute('INSERT INTO alunos(id,nome,idade,curso) VALUES(3,"Antonio",28,"Medicina")')
cursor.execute('INSERT INTO alunos(id,nome,idade,curso) VALUES(4,"Gabriela",19,"Engenharia")')
cursor.execute('INSERT INTO alunos(id,nome,idade,curso) VALUES(5,"Anthony",23,"Engenharia")')
cursor.execute('INSERT INTO alunos(id,nome,idade,curso) VALUES(6,"Caio",30,"Enfermagem")')
cursor.execute('INSERT INTO alunos(id,nome,idade,curso) VALUES(7,"Anthony",18,"Contabilidade")')


conexao.commit()
conexao.close

### 3. Consultas Básicas
Escreva consultas SQL para realizar as seguintes tarefas:

a) Selecionar todos os registros da tabela "alunos".

b) Selecionar o nome e a idade dos alunos com mais de 20 anos.

c) Selecionar os alunos do curso de "Engenharia" em ordem
alfabética.

d) Contar o número total de alunos na tabela

In [7]:
# A
import sqlite3

conexao = sqlite3.connect('alunos')
cursor = conexao.cursor()

mostrar = cursor.execute('SELECT * FROM alunos')
for usuario in mostrar:
    print(usuario)

(1, 'Ana', 22, 'Arrquitetura')
(2, 'João', 23, 'Engenharia')
(3, 'Antonio', 28, 'Medicina')
(4, 'Gabriela', 19, 'Engenharia')
(5, 'Anthony', 23, 'Engenharia')
(6, 'Caio', 30, 'Enfermagem')
(7, 'Anthony', 18, 'Contabilidade')

In [8]:
# B
mostrar = cursor.execute('SELECT nome, idade FROM alunos WHERE idade > 20')
for usuario in mostrar:
    print(usuario)

('Ana', 22)
('João', 23)
('Antonio', 28)
('Anthony', 23)
('Caio', 30)

In [9]:
#C
mostrar = cursor.execute('SELECT nome FROM alunos WHERE curso = "Engenharia" ORDER BY nome ASC')
for usuario in mostrar:
    print(usuario)

('Anthony',)
('Gabriela',)
('João',)

In [10]:
# D
mostrar = cursor.execute('SELECT COUNT(nome) FROM alunos')
for usuario in mostrar:
    print(usuario)

(7,)

### 4. Atualização e Remoção
a) Atualize a idade de um aluno específico na tabela.

b) Remova um aluno pelo seu ID.

In [11]:
# a
cursor.execute('UPDATE alunos SET idade = 25 WHERE id = 1')
mostrar = cursor.execute('SELECT * FROM alunos')
for usuario in mostrar:
    print(usuario)

(1, 'Ana', 25, 'Arrquitetura')
(2, 'João', 23, 'Engenharia')
(3, 'Antonio', 28, 'Medicina')
(4, 'Gabriela', 19, 'Engenharia')
(5, 'Anthony', 23, 'Engenharia')
(6, 'Caio', 30, 'Enfermagem')
(7, 'Anthony', 18, 'Contabilidade')

In [12]:
#
cursor.execute('DELETE FROM alunos WHERE id = 1')
mostrar = cursor.execute('SELECT * FROM alunos')
for usuario in mostrar:
    print(usuario)

(2, 'João', 23, 'Engenharia')
(3, 'Antonio', 28, 'Medicina')
(4, 'Gabriela', 19, 'Engenharia')
(5, 'Anthony', 23, 'Engenharia')
(6, 'Caio', 30, 'Enfermagem')
(7, 'Anthony', 18, 'Contabilidade')

### 5. Criar uma Tabela e Inserir Dados
Crie uma tabela chamada "clientes" com os campos: id (chave
primária), nome (texto), idade (inteiro) e saldo (float).

Insira alguns registros de clientes na tabela.

In [27]:
import sqlite3

# Establish a new connection (overwrites the existing 'conexao' variable)
conexao = sqlite3.connect('clientes')
cursor = conexao.cursor()

#cursor.execute('CREATE TABLE clientes(id INT, nome VARCHAR(100), idade INT, saldo FLT);')
cursor.execute('INSERT INTO clientes(id,nome,idade,saldo) VALUES(1,"Ana",27,1500.60)')
cursor.execute('INSERT INTO clientes(id,nome,idade,saldo) VALUES(2,"João",59,200.50)')
cursor.execute('INSERT INTO clientes(id,nome,idade,saldo) VALUES(3,"Carlos",45,1000.00)')
cursor.execute('INSERT INTO clientes(id,nome,idade,saldo) VALUES(4,"Gabriela",32,525.75)')
cursor.execute('INSERT INTO clientes(id,nome,idade,saldo) VALUES(5,"Anthony",23,1020.40)')
cursor.execute('INSERT INTO clientes(id,nome,idade,saldo) VALUES(5,"Eduardo",21,79.00)')

In [28]:
mostrar = cursor.execute('SELECT * FROM clientes')
for clientes in mostrar:
    print(clientes)

(1, 'Ana', 27, 1500.6)
(2, 'João', 59, 200.5)
(3, 'Carlos', 45, 1000)
(4, 'Gabriela', 32, 525.75)
(5, 'Anthony', 23, 1020.4)
(5, 'Eduardo', 21, 79)

### 6. Consultas e Funções Agregadas
Escreva consultas SQL para realizar as seguintes tarefas:

a) Selecione o nome e a idade dos clientes com idade superior a
30 anos.

b) Calcule o saldo médio dos clientes.

c) Encontre o cliente com o saldo máximo.

d) Conte quantos clientes têm saldo acima de 1000.

In [29]:
# a
mostrar = cursor.execute('SELECT nome, idade FROM clientes WHERE idade > 30')
for clientes in mostrar:
    print(clientes)

('João', 59)
('Carlos', 45)
('Gabriela', 32)

In [30]:
# b
mostrar = cursor.execute('SELECT AVG(saldo) FROM clientes')
for clientes in mostrar:
    print(clientes)

(721.0416666666666,)

In [31]:
# c
mostrar = cursor.execute('SELECT nome FROM clientes WHERE saldo = (SELECT MAX(saldo) FROM clientes)')
for clientes in mostrar:
    print(clientes)

('Ana',)

In [32]:
# d
mostrar = cursor.execute('SELECT COUNT(nome) FROM clientes WHERE saldo > 1000')
for clientes in mostrar:
    print(clientes)

(2,)

### 7. Atualização e Remoção com Condições
a) Atualize o saldo de um cliente específico.

b) Remova um cliente pelo seu ID.

In [33]:
# a
cursor.execute('UPDATE clientes SET saldo = 1200.00 WHERE id = 1')
mostrar = cursor.execute('SELECT * FROM clientes')
for clientes in mostrar:
    print(clientes)

(1, 'Ana', 27, 1200)
(2, 'João', 59, 200.5)
(3, 'Carlos', 45, 1000)
(4, 'Gabriela', 32, 525.75)
(5, 'Anthony', 23, 1020.4)
(5, 'Eduardo', 21, 79)

In [34]:
# b
cursor.execute('DELETE FROM clientes WHERE id = 1')
mostrar = cursor.execute('SELECT * FROM clientes')
for clientes in mostrar:
    print(clientes)

(2, 'João', 59, 200.5)
(3, 'Carlos', 45, 1000)
(4, 'Gabriela', 32, 525.75)
(5, 'Anthony', 23, 1020.4)
(5, 'Eduardo', 21, 79)

### 8. Junção de Tabelas
Crie uma segunda tabela chamada "compras" com os campos: id
(chave primária), cliente_id (chave estrangeira referenciando o id
da tabela "clientes"), produto (texto) e valor (real).


Insira algumas compras associadas a clientes existentes na tabela "clientes".

Escreva uma consulta para exibir o nome do cliente, o produto e o
valor de cada compra.

In [35]:
cursor.execute('CREATE TABLE compras(id INT PRIMARY KEY, cliente_id INT, produto VARCHAR(100), valor FLT, FOREIGN KEY (cliente_id) REFERENCES clientes(id));')

cursor.execute('INSERT INTO compras(cliente_id, produto, valor) VALUES(1, "Smartphone", 1500.00)')
cursor.execute('INSERT INTO compras(cliente_id, produto, valor) VALUES(2, "Notebook", 2500.00)')
cursor.execute('INSERT INTO compras(cliente_id, produto, valor) VALUES(3, "Tablet", 1200.50)')
cursor.execute('INSERT INTO compras(cliente_id, produto, valor) VALUES(5, "Smartphone", 1800.00)')
cursor.execute('INSERT INTO compras(cliente_id, produto, valor) VALUES(2, "Monitor", 800.75)')

mostrar = cursor.execute('SELECT clientes.nome, compras.produto, compras.valor FROM compras JOIN clientes ON compras.cliente_id = clientes.id')

for row in mostrar:
    print(row)

conexao.commit()
conexao.close()

('João', 'Notebook', 2500.0)
('Carlos', 'Tablet', 1200.5)
('Anthony', 'Smartphone', 1800.0)
('Eduardo', 'Smartphone', 1800.0)
('João', 'Monitor', 800.75)